package api03_String;

import org.snu.ids.ha.index.Keyword;
import org.snu.ids.ha.index.KeywordExtractor;
import org.snu.ids.ha.index.KeywordList;

public class Split {
	public static void main(String[] args) {
		
		String names = "tom, sam, jane";
		String[] students = names.split(", ");
		for(String name : students) {
			System.out.println(name);
		}
		
		String join = String.join("/", students);
		System.out.println(join);
		
		String txt = "계백장군 & 세종대왕, 아인슈타인, 소크라테스 -    플라톤";
		String[] celeb = txt.split("&|,|-");
		for(String c :  celeb) {
//			System.out.println(c);
			System.out.println(c.trim());
		}
		
		String wiki = "국호\r\n" + "한국의 역사\r\n" + "韓國史\r\n" + "Gyeongbokgung Palace.png\r\n" + "선사\r\n" + "시대	구석기 시대\r\n"
				+ "신석기 시대 (빗살무늬토기 시대)\r\n" + "청동기 시대 (민무늬토기 시대)\r\n" + "고조선\r\n" + "시대	단군조선\r\n" + "(?~기원전 194년)\r\n"
				+ "위만조선\r\n" + "(기원전 194년~기원전 108년)	진(辰)\r\n" + "(기원전 4세기~기원전 2세기)\r\n" + "원삼국\r\n" + "시대	부\r\n"
				+ "여	옥\r\n" + "저	동\r\n" + "예	마\r\n" + "한	진\r\n" + "한	변\r\n" + "한\r\n" + "삼국\r\n" + "시대	고구려\r\n"
				+ "(기원전 37년~\r\n" + "668년)	백제\r\n" + "(기원전 18년~660년)	신라\r\n" + "(기원전 57년~ )	가야\r\n" + "(42~\r\n"
				+ "562년)\r\n" + "　\r\n" + "남북국\r\n" + "시대	발해\r\n" + "(698~926년)	통일신라\r\n" + "(676년~ )\r\n"
				+ "후삼국\r\n" + "시대	태봉\r\n" + "(901~918년)	후백제\r\n" + "(892~936년)	신라\r\n" + "( ~935년)\r\n" + "통일\r\n"
				+ "왕조\r\n" + "시대	고려 고려\r\n" + "(918~1392년)\r\n" + "조선 조선\r\n" + "(1392~1897년)\r\n" + "대한제국 대한제국\r\n"
				+ "(1897~1910년)\r\n" + "식민지\r\n" + "시대	일제 강점기 조선\r\n" + "(1910~1945년)	　\r\n"
				+ "대한민국 임시 정부 대한민국 임시 정부\r\n" + "(1919~1945년)\r\n" + "현대	군정기 한국 (1945~1948년)\r\n"
				+ "조선민주주의인민공화국 조선민주주의인민공화국\r\n" + "(1948년~현재)	대한민국 대한민국\r\n" + "(1948년~현재)\r\n" + "v • d • e • h\r\n"
				+ "'대한민국'이란 국호 중 대한(大韓)의 어원은 고대 한반도 남부 일대에 존재했던 나라의 이름인 한(韓)에서 유래한다. 마한, 진한, 변한을 합쳐 삼한이라고 불렀으며, 고구려, 백제, 신라를 합쳐 삼한이라 부르기도 하였다. 한(韓)이라는 말은 종교적 의미와 정치적 의미가 복합적으로 이루어져 고대부터 내려오던 말로서, '하나', '하늘', '크다', '칸'(汗)[11] 등 복합적 의미가 있다.\r\n"
				+ "\r\n" + "대한\r\n"
				+ "이후 근대 국가의 국호로서 '대한'은 1897년 고종이 대한제국을 선포하면서 다시 선택한 것으로 새 국호를 정한 이유를 다음과 같이 밝혔다.\r\n" + "\r\n"
				+ "나라는 옛 나라이나 천명을 새로 받았으니 이제 이름을 새로 정하는 것이 합당하다. 삼대(三代) 이래로 황제의 나라에서 이전의 나라 이름을 그대로 쓴 적이 없다. '조선'은 기자가 봉해졌을 때의 이름이니 당당한 제국의 이름으로 합당하지 않다. 대한이란 이름을 살펴보면 황제의 정통을 이은 나라에서 이런 이름을 쓴 적이 없다... 한(韓)이란 이름은 우리의 고유한 나라 이름이며, 우리나라는 고구려·백제·신라 등 원래의 삼한을 아우른 것이니 '큰 한'이라는 이름이 적합하다.[12]\r\n"
				+ "\r\n"
				+ "작가 겸 시인인 최남선은 자신의 책 《조선상식문답》에서 이를 해설하기를 \"대한이라 함은 한(韓)은 한이지만 옛날 같은 작은 한이 아니라 지금은 커다란 한이라는 뜻을 보인 것이다. 이렇게 '대한'이란 것은 두 자가 다 합하여 나라 이름이 되는 것이요, 결코 대명(大明, 명나라)이나 대영(大英, 대영 제국)과 같이 높이는 뜻으로 대자를 붙인 것이 아니며 '한국' 이라 함은 실제 대한을 간단하게 부르는 것이다.\"라고 했다.\r\n"
				+ "\r\n" + "대한민국\r\n"
				+ "여기에 민국(民國)[13]을 더한 '대한민국'이라는 국호는 1919년 3.1운동 직후에 만들어진 대한민국 임시 정부에서 정한 것이다. 1919년 4월 10일 임시 정부의 첫 임시 의정원[14] 회의에서 국호를 정하기 위해 회의를 할 때 신석우 선생이 '대한민국'(大韓民國)으로 국호를 정하자고 하니, 여운형 선생이 '대한'이라는 이름으로 나라가 망했는데 또다시 '대한'을 쓸 필요가 있느냐고 했다. 그러자 신석우 선생이 \"대한으로 망했으니 대한으로 다시 흥해보자\"라고 부연 설명을 하며 대한제국의 '제국'을 공화국을 뜻하는 '민국'으로 바꾸어 대한민국을 국호로 제안하였고, 다수가 공감함에 따라 '대한민국'으로 결정되었다.[15][16]\r\n"
				+ "\r\n"
				+ "광복 후 1948년 제헌 국회에서 이 국호를 계승하여 헌법에 명시하였고 다시 1950년 1월 16일 국무원고시 제7호 '국호 및 일부지방명과 지도색 사용에 관한 건'에 의해 확정[17] 하였다. 이에 20세기 전반까지도 널리 사용되던 지명으로서의 '조선'이라는 이름은 '대한'이나 '한국', '한(韓)'으로 대체되어 현재 대한민국 내에서는 자주 쓰이지 않게 되었다.\r\n"
				+ "\r\n"
				+ "이에 따라 대한민국의 국민은 자국의 국호를 '대한민국', '한국' 등으로 부르며, 자국을 호칭할 때는 흔히 '우리나라'라고 한다. '대한'이라는 칭호를 사용하기도 하며, 한반도 북부에 자리한 조선민주주의인민공화국과 대비해 한반도 남부에 있다 하여 '남한'으로도 불리는데 특히 조선민주주의인민공화국은 이를 남조선(南朝鮮)이라고 부른다.[18]\r\n"
				+ "\r\n"
				+ "일본, 중화인민공화국, 대만, 베트남 등 주로 동아시아에 있는 한자 문화권 국가들은 일상에서 대한민국을 간단히 한국(중국어 간체자: 韩国, 정체자: 韓國, 병음: hánguó 한궈[*], 일본어: 韓国, かんこく 간코쿠, 베트남어: Hàn Quốc한 꾸옥)이라 부른다. 한반도 전체를 부를 때는 조선(중국어 간체자: 朝鲜, 정체자: 朝鮮, 병음: cháoxiǎn 차오시엔[*], 일본어: 朝鮮, ちょうせん 조센, 베트남어: Triều Tiên찌에우 띠엔)이라고 한다.\r\n"
				+ "\r\n" + "Korea\r\n"
				+ "현재 영어권 국가에서 불리는 국호인 Korea의 시초는 기원전 1세기부터 7세기까지 한반도 북부와 만주 지방에 존재했던 고구려[Goguryeo]에서 전해온다. 고구려는 장수왕 때 국호를 고려로 변경한 바 있으며, 후에 후삼국을 통일한 왕건이 고구려를 계승하는 의미로 국호를 고려로 정하였다. 그 후 당시 아라비아 상인들이 고려의 수도인 개성으로 통하는 벽란도를 출입하면서, 고려라는 이름이 Corea로 음역 되어 전 세계에 전해졌다.[19] 그 후 서방에 전해져 프랑스어로 Corée, 스페인어로 Corea, 영어로 Korea라고 불리게 되었다. 현재 대한민국의 공식 영어 명칭은 Republic of Korea로서, 약칭 'R.O.K.'로 사용한다.\r\n"
				+ "\r\n"
				+ "대한제국 시절 공식 문서에는 Corea 또는 Korea가 혼용되어 사용되었고, 1900년대 초기(~1910년까지)부터 영어권에서는 Korea가 점점 사용 빈도가 높아지게 되었다. 1892년 외국인이 자주 보는 잡지 〈The Korean Repository〉 5월호에는 “미국 국무부와 영국의 왕립지리학회는 우리가 차용한 이 땅의 이름을 아주 조리 있게 Korea로 표기하기 시작했던 것”이라는 내용이 나온다.[20]\r\n"
				+ "\r\n"
				+ "일본은 19세기 말부터 1905년 이전까지는 Corea로 한국을 표기하다가 일제강점기에는 Corea나 Korea를 배격하고 Chosen이라는 알파벳 국호를 사용했다.[20]\r\n"
				+ "\r\n" + "연호\r\n" + "대한민국 공용(公用) 연호(年號)는 서력기원으로 한다.\r\n"
				+ "— 연호에 관한 법률(법률 제12209호, 2014. 1. 7. 일부개정)\r\n" + "\r\n"
				+ "1948년 8월 15일부터 9월 24일까지 대한민국기원으로 1919년을 원년으로 사용하다 같은 해 9월 25일부터 1961년 12월 31일까지 단군기원을 사용했다. 이후 <연호에 관한 법률>에 따라 1962년 1월 1일부터 서력기원을 사용한다.\r\n"
				+ "\r\n"
				+ "서력기원 연대와 단군기원 연대의 차이는 2333년이다. 현재의 서력기원은 공문서 등에 공용 연호로 사용하고 있다. 종교계, 학계 등 민간에서 단군기원을 사용하는 것을 금지하고 있는 것은 아니다.\r\n"
				+ "\r\n" + "지리\r\n" + "지형\r\n" + "\r\n" + "대한민국의 지도\r\n"
				+ "대한민국은 동해를 사이에 두고 일본 열도와, 황해를 사이에 두고 중화인민공화국과 마주하며, 육지로는 군사 분계선을 사이에 두고 조선민주주의인민공화국(북한)과 맞닿아 있다.[21]\r\n"
				+ "\r\n"
				+ "한반도는 제3기 마이오세 이후에 일어난 단층과 요곡운동의 결과 동쪽으로는 높은 산지가 급경사로 동해안에 임박하고 서쪽으로는 서서히 고도가 낮아진다. 이를 동고서저의 경동지형이라 한다. 높은 산들은 대부분 동부 지방에 치우쳐서 한반도의 등줄기라 불리는 태백산맥에 자리한다. 태백산맥의 대표적인 산이 설악산이다. 태백산맥의 남서쪽으로 소백산맥이 이어지며 그 중에는 지리산이 유명하다. 제주도에는 대한민국에서 가장 높은 산이자 사화산인 한라산이 있다.\r\n"
				+ "\r\n" + "\r\n" + "대한민국의 지형도\r\n"
				+ "하천의 유량은 극히 불규칙하여 여름에는 집중 호우로 연 강수량의 약 60% 이상이 홍수로 유출되며, 갈수기에는 강바닥을 거의 드러내는 하천이 많다. 대표적인 강은 위쪽부터 반시계 방향으로 한강, 금강, 영산강, 섬진강, 낙동강 등이다. 대다수의 강이 산지가 많은 동쪽에서 평평하고 낮은 구릉이 대부분인 서쪽으로 흐르며 중하류에 비교적 넓은 충적평야가 전개된다.\r\n"
				+ "\r\n"
				+ "산맥은 교통에 적지 않은 제약을 주어, 산맥을 경계로 지역의 문화나 풍습이 크게 차이가 나기도 한다. 산맥으로 가로막힌 지방은 고개를 넘어 왕래했는데 영서 지방과 영동 지방을 연결하는 태백산맥의 대관령·한계령·진부령·미시령, 중서부와 영남 지방을 연결하는 소백산맥의 죽령·이화령·추풍령·육십령 등이 산맥을 넘는 주요한 교통로로 사용된다.\r\n"
				+ "\r\n"
				+ "한반도의 서쪽은 황해, 동쪽은 동해, 남쪽은 남해와 맞닿아 있어 삼면이 바다로 둘러싸인 반도형이며, 가장 큰 부속 도서인 제주도 남쪽으로는 동중국해와 접한다. 황해와 남해 연안은 해안선이 복잡한 리아스식 해안으로 조수 간만의 차가 클 뿐만 아니라 해안 지형도 꽤 평탄하여 넓은 간석지가 전개된다. 또한 수많은 섬이 있어서 다도해라고도 불린다. 반면에 동해 연안은 대부분 해안선이 단조롭고 수심이 깊으며 간만의 차가 적다. 해안 근처에는 사구·석호 등이 형성되어 있고 먼 해상에 화산섬인 울릉도가 있으며 그보다 동쪽으로 약 87.4km 거리에 대한민국 최동단인 독도가 위치한다.\r\n"
				+ "\r\n" + "기후\r\n" + "\r\n" + "인공위성으로 촬영한 대한민국.\r\n"
				+ "북위 33도~38도, 동경 126~131도에 걸쳐 있어 냉대 동계 소우 기후와 온대 하우 기후, 온난 습윤 기후가 나타난다. 겨울에 북부 지역은 편서풍으로 인해 시베리아와 몽골 고원의 영향을 받아 대륙성 기후를 띠어서 건조하고 무척 추우나 남부 지역은 이런 영향을 적게 받아 상대적으로 온난한 편이다. 여름에는 태평양의 영향을 받아 해양성 기후의 특색을 보여서 고온다습하다. 계절은 사계절이 뚜렷이 나타나며 대체로 북부 지역은 여름과 겨울이 길고 남부 지역은 봄과 가을이 길다.\r\n"
				+ "\r\n"
				+ "4월 초에서 5월에 걸쳐 포근한 봄 날씨, 6월경에서 9월 초에는 무더운 여름이, 9월 말에서 10월 말까지는 화창하고 건조한 가을 날씨가 이어지고, 11월에 기온과 습도가 점차 낮아지기 시작하여 12월에서 2월까지는 춥고 건조한 겨울 날씨를 보인다. 중부 산간 지방을 제외하고 대체로 연 평균 기온은 10 ~ 16℃이며, 가장 무더운 달인 8월은 23 ~ 36℃, 5월은 16 ~ 19℃, 10월은 11 ~ 19℃, 가장 추운 달인 1월은 -6 ~ 3℃이다.[22]\r\n"
				+ "\r\n"
				+ "비는 주로 여름에 많이 내리는데 연 강수량의 50 ~ 60%가 이때 집중된다. 이를 장마라고 하며 특히 6월 말에서 7월 중순까지를 장마철이라 한다. 각 지역의 연 평균 강수량은 중부 지방이 1100 ~ 1400mm, 남부 지방이 1000 ~ 1800mm, 경북 지역이 1000 ~ 1200mm이다. 경상남도 해안 지역은 약 1800mm이며 제주도는 1450 ~ 1850mm이다.[22]\r\n"
				+ "\r\n"
				+ "습도는 7월과 8월이 높아서 전국에 걸쳐 80%정도이고 9월과 10월은 70% 내외이다. 태풍은 북태평양 서부에서 연평균 28개 정도가 발생하여, 이 중 두세 개가 영향을 미친다.[22]\r\n"
				+ "\r\n" + "동식물\r\n" + " 대한민국의 식생 문서를 참고하십시오.\r\n" + "\r\n" + "시베리아호랑이는 한국호랑이와 비슷한 종류이다.\r\n"
				+ "한반도 전역에 동식물 10만여 종이 분포한다. 호랑이 중에서 가장 큰 종인 시베리아호랑이가 과거 살았었으나 현재는 보이지 않는다. 그 밖의 맹수로는 반달곰과 표범이 있으며 소수 개체군이 생존한다. 그 밖에도 멧돼지, 고라니, 너구리 등의 포유류와 까치, 꿩, 참새, 비둘기를 비롯한 텃새, 두루미, 기러기 같은 철새가 서식하며 지네나 거미, 수많은 곤충류도 있다. 삼면이 바다여서 난류와 한류에 서식하는 다양한 어패류와 고래도 존재한다. 다만 최근에는 지구 온난화로 한류성 어류가 감소하고 불가사리나 해파리가 급증해서 큰 문제가 되고 있다.\r\n"
				+ "\r\n"
				+ "산삼이나 진달래, 소나무 등 많은 식물은 약용이나 기타 여러 용도로 쓰인다. 제주도에는 열대림과 비슷한 야자수가 번육하며 지리산이나 태백산맥에는 북방계형의 특산 식물들이 자생한다. 백두산에는 시베리아나 만주에서만 볼 수 있는 침엽수림과 같은 북방계 식물류가 자란다. 중부 지방에는 높은 산지로 말미암아 고산형 식물과 약용식물 여러 종이 자생한다.\r\n"
				+ "\r\n" + "천연자원\r\n" + " 대한민국의 자원 문서를 참고하십시오.\r\n"
				+ "시멘트 공업과 석회공업(石灰工業)의 원료인 석회암은 한국의 주요 자원으로 각지에 대량 분포해 있다. 다른 자원은 양이 적거나 품질이 낮아 채산성이 맞지 않는 탓에 거의 생산하지 않는다. 다만 21세기 이래 국제 원자재 가격의 상승과 기술의 발전으로 재개장하는 광산이 있다. 석탄은 무연탄만이 있으며 삼척, 태백 일대에 집중되어 있다. 철광석은 양양, 충주 등지에서 주로 캤다. 텅스텐은 매장량이 매우 많으며 특히 영월에 엄청난 규모의 광산이 있다.\r\n"
				+ "\r\n"
				+ "울산 앞바다에서는 천연가스층이 발견되어 개발하고 있으며, 독도 부근 해저에는 메테인 하이드레이트가 상당량 묻혀 있는 것으로 알려져 있다. 석유는 제주도 남방 해역의 대륙붕 제7광구에 천연가스와 함께 매장되어 있을 가능성이 언급되지만[23] 실제로 탐사되지는 않았다. 이곳은 1974년에 체결한 한일 대륙붕 협정에 의해 2028년까지 한일이 공동 관리한다.\r\n"
				+ "\r\n" + "역사\r\n" + "<nowiki />이 부분의 본문은 대한민국의 역사입니다.\r\n"
				+ " 1948년 이전 한반도를 중심으로 한 한민족의 역사에 관해서는 한국의 역사 문서를 참고하십시오.\r\n"
				+ " 이 문단의 내용은 출처가 분명하지 않습니다. 지금 바로 이 문단을 편집하여, 참고하신 문헌이나 신뢰할 수 있는 출처를 각주 등으로 표기해 주세요. 검증되지 않은 내용은 삭제될 수도 있습니다. 내용에 대한 의견이 있으시다면 토론 문서에서 나누어 주세요. (2018년 7월 6일에 문단의 출처가 요청되었습니다.)\r\n"
				+ "기원\r\n" + "<nowiki />이 부분의 본문은 한민족입니다.\r\n" + "\r\n" + "한민족의 영산(靈山)으로 일컬어지는 백두산 천지.\r\n"
				+ "한반도에 두 발로 걷고 도구를 이용하는 사람들이 살기 시작한 시기는 기원전 약 70만 년 이전으로 추정되며, 현생인류는 후기 구석기 시대인 약 2만 5천 년 전부터 해안과 강가를 중심으로 거주하기 시작한 것으로 보인다. 인골 화석으로는 충청북도 단양군 상시굴과 두루봉동굴, 제천시 점말굴 등에서 현생인류로 추정되는 사람 뼈 화석이 발견된 바 있다. 이후 중석기 시대와 신석기 시대를 거치면서 여러 빗살무늬 토기인, 무문토기인 등 여러 인종의 유입과 주변 세력들과의 상호작용을 통해 문명이 발전했다. 다만 초기 구성원들의 이동과 외부 세력 유입의 구체적 모습은 확실하지 않다.\r\n"
				+ "\r\n"
				+ "한반도 일대의 최초의 국가는 고조선이다. 일연의 《삼국유사》에서는 현전하지 않는 《고기》를 인용하여 단군 왕검이 고조선을 세웠다고 기록하였고 《동국통감》에서 그 시기를 기원전 2333년이라 하였다. 날짜는 대종교에서 임의로 음력 10월 3일로 약속하고 개천절이라 불렀는데 대한민국 정부에서 그 날을 양력으로 고쳐 국경일로 지정하였다. 고조선 멸망을 전후하여 부여, 옥저, 동예, 진국, 삼한 등 여러 나라가 생겨났고, 이후 고구려, 백제, 신라의 삼국 시대로 이어졌으며 이 중 신라가 삼국을 부분적으로 통일하는 한편 북쪽의 발해와 함께 남북국 시대를 형성했다. 10세기 고려가 등장하면서 한민족 단일 국가의 시대를 시작했고 14세기 조선이 이를 계승했다.\r\n"
				+ "\r\n"
				+ "근대 한국의 뿌리는 1897년에 수립된 대한제국이다.[24] 고종 황제는 나라 이름을 조선(朝鮮)에서 대한(大韓)으로 고치고, 연호를 광무(光武)라 정하고, 스스로 황제의 자리에 올랐다. 최초의 근대적 헌법인 대한국 국제를 반포하였고, 미국, 영국, 독일, 프랑스, 이탈리아, 러시아, 일본, 청나라 등과 수교하였다. 광무개혁을 단행하여 신식군대를 설치하고, 근대적 사법·토지 제도를 도입하고, 상공업을 진흥하고, 근대적 병원과 학교 및 은행 등을 설립하였다. 해외에 유학생을 파견하여 근대 산업기술을 습득하게 하고, 제조·철도·운수 등 여러 분야에서 근대적 기업과 공장을 설립하였다. 그러나 대한제국의 자주적 근대화 노력은 1895년 청일 전쟁으로 일본의 영향력이 커진 이래 간섭을 받아왔으며, 1904년에는 러일전쟁에서 일본이 승리한 뒤로 일본의 한국 병합이 본격화되었다. 1905년 을사조약을 무력으로 체결하여 외교권을 박탈하고, 1907년 고종 황제를 폐위하고, 1910년 한일 병합 조약을 통해 국권을 빼앗기며 일제 강점기로 전환, 근대적 자주국가라는 목표는 사라지고 말았다.\r\n"
				+ "\r\n" + "대한민국 임시정부\r\n" + " 일제강점기, 대한민국 임시정부 문서를 참고하십시오.\r\n" + "\r\n"
				+ "대한민국 임시정부 국무원 기념 사진(1919년 10월 11일).\r\n"
				+ "1919년 3월 1일, 한국인들은 민족대표 33인의 독립선언서 낭독을 시작으로 독립을 위한 3·1운동을 펼쳤다. 이 운동은 대체로 각 지역에서 정기적으로 열리던 장(시장)의 개장일에 맞추어 전국으로 퍼져 나갔다. 일본은 시위를 무력으로 진압하였으나 폭압 통치 방식의 한계를 느껴 헌병 경찰 통치에서 문화 통치로 전환하였다. 이는 국내외 독립운동의 새로운 전환점을 마련하게 된다.\r\n"
				+ "\r\n"
				+ "4월 11일, 3·1운동의 정신을 이어받아 중화민국 상하이에서 대한민국 임시정부가 수립되었다. 임시정부는 대한민국 임시 헌법을 제정하여 대통령제와 3권 분립을 채택하고 한국의 독립을 위하여 외교·군사적으로 노력했다. 그러나 독립운동 노선의 갈등으로 여러 인사들이 빠져나가면서 국무령 중심의 집단지도체제로 전환하고, 일제의 방해까지 겹쳐 온갖 고난과 어려움을 겪었다. 1930년대 일본의 중국 침탈이 가속화되자 내륙으로 청사를 이전하여 중일전쟁이 한창이던 1940년에는 충칭에 정착하였다.\r\n"
				+ "\r\n"
				+ "이후 김구를 주축으로 주석중심제로 재정비하고 조소앙의 삼균주의를 건국강령으로 채택하였다. 한국 광복군도 조직하여 1941년 12월 태평양 전쟁을 일으킨 일본에 선전포고하고 1942년 2월에는 대독 선전포고까지 하여 연합군의 일원으로 참전하고자 하였다. 1942년에는 좌파계열인 조선민족혁명당의 김규식, 김원봉 세력과 김성숙, 유림 등의 무정부주의자들이 임시정부에 합류하여 민족통일전선 형성의 기틀이 마련되었다. 1943년 버마 전선의 영국군과 연합작전을 전개하고자 공작대를 파견하여 일본군 포로 취조 및 암호 번역, 선전 전단 작성, 대적 회유 방송 등을 하였다. 미국 OSS와도 연계하여 1945년 9월을 기한으로 국내 진공 작전을 준비했으나, 8월 15일 일본이 항복하여 성사되지 못했다. 현행 대한민국 헌법 전문에는 대한국민이 3·1운동에 따라 건립된 대한민국 임시 정부의 법통을 계승한다는 문구가 삽입되었다.\r\n"
				+ "\r\n" + "군정기와 해방 정국\r\n" + "<nowiki />이 부분의 본문은 대한민국 정부 수립 및 군정기입니다.\r\n" + "\r\n"
				+ "1948년 대한민국 정부 수립 선포식\r\n" + "\r\n" + "1945년 8월 15일부터 1948년 7월까지 38선 이남에서 사용한 태극기\r\n"
				+ "1945년 8월 15일, 일본제국이 미국에 무조건 항복함으로써 대한민국은 일제 치하로부터 벗어나 광복을 맞이하였다. 그러나 광복 이후 한반도는 얄타회담에서 이루어진 비공식적 합의에 따라 소련과 미국의 신탁 통치하에 들어갔다. 1945년 9월에는 한반도의 북위 38도선을 경계로 남쪽은 미군이, 북쪽은 구 소련군이 포고령을 선포하여 각각 군정을 실시하면서 한반도는 남과 북으로 분단되었다.\r\n"
				+ "\r\n"
				+ "광복 이후 여운형, 안재홍 등은 1944년 설립한 지하조직인 건국동맹을 모태로 조선건국준비위원회를 개최하였고, 9월 여운형, 박헌영 등에 의해 조선인민공화국 내각이 수립되었다. 그러나 1945년 11월 중화민국 쓰촨성 충칭에서 개인 자격으로 귀국한 대한민국임시정부 요인들과 '임정정통론' 문제로 갈등이 벌어졌고, 미군정은 맥아더 포고령에 따라 인공 내각(조선인민공화국 내각)과 임시정부를 승인하지 않음으로써 인공 내각은 해산되었다.\r\n"
				+ "\r\n"
				+ "1945년 12월에 모스크바 3상 회의에서 신탁통치안 문제를 놓고 한반도 내에는 좌, 우익 세력간 대립이 격화되었다. 곧이어 1946년 5월에는 미소공위가 개최되었으나 양측의 주장이 엇갈려 결렬되었다. 이때 김규식, 여운형, 안재홍 등은 통일 임시정부 수립을 위해 좌우합작운동을 개시하여 미소공위를 재개하고자 하였지만, 한민당과 남로당 등 좌우익세력간에 불참으로 중도파 세력만의 운동으로 축소되었다. 1945년 12월 송진우 암살, 1947년 7월에 여운형 암살 등 해방정국의 잇단 사건으로 좌우합작운동은 실패로 끝났다.\r\n"
				+ "\r\n" + "대한민국 정부 수립\r\n"
				+ "미 군정은 온건파인 김규식, 안재홍, 여운형을 통해 좌우 합작과 협상을 주도하게 했다. 그러나 헤게모니 장악에서 제외된 것에 불만을 품은 이승만, 김구, 윤치영, 박헌영, 허헌 등의 반발에 봉착하게 되었다. 이후 제2차 미소공위 마저 결렬되어버리자 미국은 한반도 문제를 UN 총회로 이관했고, 총회에서 남한 내 단독정부 수립이 결정되었다. 이에 김규식, 조소앙, 김구 등은 통일 정부를 수립하기 위해 남북협상 등을 추진하여 노력하였으나 수포로 돌아가고, 남한에서도 선거 가능한 지역에 한한 정부 수립론이 제기되면서 (정읍 발언) 사실상 남북단일 정부 수립은 불가능한 모양새가 되었다.\r\n"
				+ "\r\n"
				+ "1948년 1월부터 한반도의 정국은 단독 정부 수립론과 남북 협상을 통한 정부 수립론을 놓고 의견이 갈라서게 되었다. 그러나 1948년 2월 38선 이북에서는 북조선인민위원회를 구성하고, 조선인민군을 창건하면서 분단은 사실상 불가피하게 되었다. 5월 10일 38도선 이남에서만 제헌 의원 총선거가 실시되어 제헌 국회가 탄생하였고, 같은 해 7월 17일에는 초대 헌법인 대한민국 제헌 헌법이 구성되었다. 7월 22일에는 국회의 간접 선거로 이승만이 초대 대통령, 이시영이 초대 부통령으로 선출되었고, 8월 15일에는 대한민국 정부 수립이 선포되었다.\r\n"
				+ "\r\n" + "	위키문헌에 이 글과\r\n" + "관련된 원문이 있습니다.\r\n"
				+ "United Nations General Assembly Resolution 293\r\n"
				+ "12월 12일 \"유엔 총회 결의 195(III) 한국의 독립 문제\"에서 대한민국이 \"한반도에서 유일하게 그러한 정부(the only such Government in Korea)\"임을 선언하였다. 여기서 '그러한'은 대한민국이 임시위원단의 감시 하에서 주민들 대다수의 자유 의사에 따라 수립되었고, (분단상태를 고려할 때)선거가 가능했던 그 지역에 대한 유효한 지배권과 관할권을 가진 합법정부임을 뜻한다. 이미 48년 9월 9일에 한반도 이북에서는 조선민주주의인민공화국이 선포되었음에 미루어 그 해 12월의 결의는 대한민국만을 한반도에서 유일한 합법정부로 인정한 것이다.\r\n"
				+ "\r\n" + "한국 전쟁\r\n" + "\r\n" + "6·25 전쟁 중 동생을 등에 업고 지나가는 소녀\r\n"
				+ "<nowiki />이 부분의 본문은 한국 전쟁입니다.\r\n"
				+ "조선민주주의인민공화국의 김일성은 남침을 기도하여 공산주의화 하려는 야망을 실현하고자 준비하였다. 소련의 지도자인 이오시프 스탈린의 승인을 받자, 소련에서 지원받은 수십대의 소련제 탱크를 앞세워 대한민국을 1950년 6월 25일 새벽 4시에 침공했다. 당시 대한민국에는 탱크의 공세를 막을 수 있는 방어책이 전혀 없었고 야포와 전투기 등 모든 것이 압도적으로 열세였기 때문에 총만 가진 거의 맨 몸의 한국군은 순식간에 밀려날 수 밖에 없었다. 그렇게 대한민국은 조선인민군이 침략한 3일만에 수도인 서울을 인민군에게 빼앗기게 된다. 치밀하게 계획하고 무장한 인민군을 상대하는 것이 계란으로 바위치기였던 한국군은 결국 밀려나 낙동강 방어선을 최후의 배수진으로 정하고 버티었다. 이 과정에서 수많은 어린 학생들(학도병들)이 무고하게 죽어나갔으며 많은 사상자와 인명피해가 초래되었다.\r\n"
				+ "\r\n"
				+ "하지만 UN군이 파병으로 지원하고 UN군 총사령관 더글러스 맥아더가 9.15일 인천 상륙 작전을 벌여 조선인민군에 반격을 시작하자 얼마 지나지 않아 대한민국은 9월 27일에 서울을 탈환해냈다. 10월 1일에는 38도선까지 수복해서 원점으로 돌아갔다. 이 때 유엔 내부에서 맺어진 새로운 결의로 유엔군의 목적이 조선민주주의인민공화국을 완전히 공략하려는 목적으로 변경되었다. 이후 한국과 UN군은 거듭해서 10월 26일에는 압록강까지 올라갔으나 곧 이어 중화인민공화국이 인해전술을 펼치며 참전하고 소련이 군사를 지원하여 전세가 다시 역전되었고 전쟁은 장기화되었다. 이후 38도선 인근 중부 지방에서 교착을 거듭하던 1953년 7월 27일에 휴전협정이 오전 10시에 체결된 후에 효력이 발생한 22시에 완전히 전투가 종료되고 군사 분계선이 형성되면서 오늘날까지 휴전 상태가 이어지고 있다.\r\n"
				+ "\r\n"
				+ "한국 전쟁으로 20만 명이 과부가 되었고 10만여 명 이상이 고아가 되었으며 1천만여 명 이상이 이산 가족 신세가 되었다. 한반도 내 45%에 이르는 공업 시설이 파괴된 탓에 경제적, 사회적 암흑기가 도래하여 한국과 북한의 경제 수준이 떨어졌다. 무엇보다도 이 전쟁으로 인해 남북 간에 서로에 대한 적대적 감정이 극도로 팽배하게 되어 한국의 분단이 더욱 고착화되면서, 분단한 지 70여년에 이르고 있다.\r\n"
				+ "\r\n" + "제1·2공화국\r\n" + "\r\n" + "1960년 4.19 혁명.\r\n"
				+ "<nowiki />이 부분의 본문은 제1공화국, 4·19 혁명, 및 제2공화국입니다.\r\n"
				+ "한국 전쟁이 휴전 협정을 맺은 후 1950년대는 미국으로부터 지원을 받아 전후복구사업을 실시하는 가운데 경제원조체제가 성립되던 시기였다. 제1공화국 정권의 고위 관료는 부패해 국민의 불만을 샀다. 의원 내각제였던 제1대 내각에서 재선이 불가능하다 판단한 이승만은 이범석과 장택상을 비롯한 측근들과 족청계, 백골단, 땃벌떼 등을 동원하여 부산정치파동(1952년), 사사오입 개헌(1954년)을 일으키고 장기집권을 추진했다. 그러나 이범석, 장택상 등의 성장을 두려워한 이승만은 이들을 제거하고 이기붕 계열을 등용한다. 이기붕 계열은 또한 친 자유당 성향의 이정재, 임화수, 유지광 등의 정치깡패들을 활용하여 야당 의원의 집회를 탄압, 제1공화국 후반기는 혼란을 거듭했다.\r\n"
				+ "\r\n"
				+ "그 와중에 부통령 장면의 피격 사건(1958)과 조봉암 사법살인(1959) 등의 조치까지 겸해졌고 언론의 자유마저 통제당했다. 1959년의 한일회담이 끝나자 곳곳에서 정부의 독재에 저항하는 집회가 시작, 1960년 3월 15일 부통령 선거의 부정을 계기로 국민들의 불만은 극에 달해 4·19 혁명이 발생했고, 마산 앞바다에서 며칠 전 실종되었던 김주열의 주검이 떠오르면서 시위는 격화되었다. 4월 26일 이승만 대통령이 하야를 선언하여 제1공화국은 붕괴했다.\r\n"
				+ "\r\n" + "\r\n" + "제2공화국 국무총리 장면\r\n"
				+ "4·19 혁명 이후 허정 과도 내각을 거쳐 장면을 수상으로 하는 제2공화국이 수립됐다. 제2공화국은 3차 개헌을 통해 내각책임제와 양원제를 구성했고, 언론 자유와 혁신계 정치활동을 허용했다. 제2공화국 당시 각계 각층의 통일 운동과 민주화 요구가 분출되기도 했는데, 집권 여당인 민주당 사이에서 신파와 구파가 나뉘어버려서 개혁 의지가 미약한 탓에 이러한 요구들을 수용하지 못했다. 곳곳에서 데모가 연이어 벌어졌고, 장면이 단호한 조치를 계획하던 중 1961년 5월 16일 새벽 5·16 쿠데타로 내각 각료들이 체포되면서 장면 내각은 1년 남짓밖에 집권하지 못하고 무너졌다.\r\n"
				+ "\r\n"
				+ "그 뒤 윤보선은 형식적인 민정을 실시하였으나 군사정변 세력에게 구정치인 정화법(1962)으로 정치활동을 정지당하자 여기에 불만을 품고 사퇴(1962.3.22)함으로써 1962년 3월부터 1963년 12월까지 5·16 군사정변 세력이 설립한 국가재건최고회의가 사법권·행정권·입법권을 모두 장악하고 군정을 실시했다.\r\n"
				+ "\r\n" + "제3·4공화국\r\n" + "\r\n" + "1961년 5.16 군사정변 당시 박정희.\r\n"
				+ "<nowiki />이 부분의 본문은 대한민국 제3공화국, 대한민국 제4공화국, 및 최규하 정부입니다.\r\n"
				+ "1963년 12월 5·16 군사 정변을 주도한 박정희 등에 의해 제3공화국이 수립됐다. 야당 후보인 윤보선과의 두 차례의 선거전에서 10만 표 안팎의 근소한 차로 집권하였다. 재임 초반 한일 협정을 추진하는 과정에서 공분을 사 일어난 시위를 무력 진압하며 강행했다. 1960년대 개발 독재의 일환으로 정부는 경공업 중심의 수출 주도형 발전과 한일협정·베트남 전쟁 파병 등을 통한 외화 획득으로 경제 발전을 꾀했다. 1970년대에는 중화학 공업과 전자산업을 집중적으로 육성했다. 하지만 도시와 농촌의 소득 격차, 저임금 노동과 빈부격차와 같은 문제도 남겼다.\r\n"
				+ "\r\n"
				+ "이후 박정희 정부는 3선 개헌을 통과시키고 1971년 대선에서 3선에 성공한다. 그런데 대선에서 야당 후보가 돌풍을 일으키고 같은 해 총선에서 야당의 의석수가 2배로 늘어나는 선전을 이룬 데다가 제1차 석유 파동 등으로 경제성장도 한계를 보이기 시작하면서 정권 유지에 위기를 느낀 박정희 정부는 1972년 유신 헌법을 통과시키고, 제4공화국을 선포하였다.\r\n"
				+ "\r\n"
				+ "1971년 대통령 선거에서 야당의 돌풍으로 불안감을 느낀 박정희는 1972년 7·4 남북공동성명을 발표하고, 통일을 준비한다는 명목으로 10월 유신을 선포해 유신체제를 수립했다. 이를 통해 대통령의 임기를 6년 연임제로 수정하는가 하면 국회의원을 대통령이 임명하게 할 수 있는 법안까지 통과시키는 등 대통령의 권한을 비정상적으로 확대시켰다. 이에 노동운동계, 재야와 학생 세력 등이 민주화를 요구하지만, 정부는 잇따른 긴급조치를 통해 억눌렀다. 하지만 민주화 운동 세력 및 노동운동가의 반발은 계속되었다. 미국이 한국의 '인권 침해'를 비판하기 시작하자 한미 간 외교적 마찰이 일어났다. 제2차 석유 파동까지 겪으면서 경제위기와 내부 혼란이 크게 가중되었다. 김영삼 의원제명 파동과 YH 무역 농성 사건, 부마 항쟁 등의 사회적 저항이 지속되었다. 이러한 일들은 권력 내부의 분열을 초래하였으며, 1979년 박정희가 중앙정보부장 김재규에게 암살되면서(10·26 사건) 박정희의 17년 장기 집권은 막을 내렸다.\r\n"
				+ "\r\n"
				+ "10·26 사건 이후 유신 체제 하에서 국무총리 최규하가 이끄는 정부가 출범했다. 유신 헌법 폐지를 통해 민주화를 추진하려는 움직임이 나타나던 시기, 최규하 정부는 긴급조치를 해제함으로써 일부 정치적 억압을 완화했고, 1979년 12월과 1980년 2월, 1980년 4월에 대사면령을 단행하였다. 그러나 전두환을 비롯한 이들이 12월 12일에 군사반란을 일으켜 실권을 장악하였고, 급기야 최규하 대통령에게 간섭하기 시작했다. 이들은 1980년 쿠데타를 일으키면서 최규하 정부는 1980년 8월 최규하 대통령의 사임으로 붕괴되고 말았다.\r\n"
				+ "\r\n" + "제5공화국\r\n" + "<nowiki />이 부분의 본문은 대한민국 제5공화국입니다.\r\n"
				+ "전두환과 하나회를 중심으로 한 신군부는 12·12 군사 반란을 일으켜 계엄 사령관을 체포하고 군부를 장악하여 실세로 떠올랐고, 민주화 일정을 지체시켰다. 1980년 초부터 국회와 정부는 유신 헌법을 철폐하기 위한 개헌 논의를 진행했고, 대학생과 재야 세력도 정치 일정 제시와 전두환 퇴진 요구를 바탕으로 민주화 시위를 벌였다. 이에 신군부는 5월 17일 비상계엄을 전국확대하면서, 이른바 '화려한 휴가'라고 불리는 포고령을 통해 '정치활동 금지', '보도검열 강화', '휴교령' 등을 선포하고 군병력을 동원해 국회를 폐쇄했다. (5.17 쿠데타) 이 과정에서 신군부는 5·17 쿠데타에 항거한 광주 민주화 운동을 공수부대 및 특전여단을 투입해 유혈진압을 하고, 5월 27일 국가보위비상대책위원회를 만들어 정국을 주도했다. 10월 27일에는 7년 단임의 대통령제를 골자로 한 제5공화국 헌법이 공포되고 이듬해 제5공화국이 출범했다.[25]\r\n"
				+ "\r\n"
				+ "제5공화국은 경제 안정에 매진하는 한편, 1981년에는 1986년 아시안 게임, 1988년 서울 올림픽 등을 유치하기도 했다. 또한 야간통행금지 해제 및 교복 자율화 등의 유화 조치를 내걸어 국민들의 불만을 잠재우기도 했다. 한편으로 임기 중반부터 3저호황으로 인한 수출 흑자를 기록했다. 그러나 다른 한편으로는 권위주의적인 독재체제를 성립하고 민주주의 탄압 및 고문·정치사찰·용공조작으로 대변되는 인권 유린행위를 자행했으며, 정경유착·부정축재·친인척 비리가 빈발했다.\r\n"
				+ "\r\n"
				+ "1987년 1월 박종철이 고문으로 치사하는 사건이 터지자 정부 퇴진과 민주화 요구의 목소리는 더욱 커졌다. 이에 정부는 호헌조치를 취하며 '개헌할 의도가 없음'을 내세웠고, 국민들의 민주화 요구는 더욱 빗발쳐 6월 항쟁으로 이어졌다. 마침내 전두환 대통령은 민정당 총재 노태우를 통해 6·29 선언을 발표하면서 국민의 개헌 요구를 수용했다. 개정된 헌법에 따라 치러진 제13대 대통령 선거에서는 여당 노태우가 당선되었고, 1988년 2월 취임식과 함께 제5공화국은 막을 내린다.\r\n"
				+ "\r\n" + "\r\n" + "1988년 서울 올림픽\r\n" + "노태우 정부와 문민정부\r\n"
				+ "<nowiki />이 부분의 본문은 노태우 정부 및 김영삼 정부입니다.\r\n"
				+ "1987년 6월 29일, 당시 민주정의당 총재이자 대통령 후보였던 노태우가 대통령 직선제 등을 주 내용으로 하는 6·29 선언을 발표했다. 이후 여야가 합의하여 대통령 직선제 등을 골자로 한 개헌이 성사되었다. 이로써 야권의 정치 참여가 허용되었으며, 1988년 치러진 제13대 총선에서는 사상 최초의 '여소야대' 국회가 나왔다. 민주정의당은 불리한 여론을 극복하는 돌파구로 3당 합당을 추진해 민주자유당을 탄생시켰다. 또한 전두환 측근에 대한 사법조치를 단행(국정감사)하고 민간인들을 정계에 대폭 고용하기도 했다(과거와의 단절). 외교 면에서 노태우 정부는 북방정책을 추진해 구 소련을 비롯한 공산권 국가들과의 수교 등 관계 개선에 주력했다. 1991년 9월 유엔의 가맹국이 되었으며, 이어서 12월에는 남북기본합의서를 채택했다. 또한 1992년에는 지방 자치 제도를 실시하게 되었다.\r\n"
				+ "\r\n"
				+ "그러나 노태우도 전두환처럼 군인 출신이었고, 12·12 사태를 주도하고 5공 성립 과정에 깊숙히 관여한 인물이라는 한계가 있었다. 노태우 정부도 정경유착은 물론 비자금 형성·민간인 사찰·고문 등 5공의 파쇼 정치를 그대로 답습했다(이 때문에 노태우 정권을 군사정권의 연장선으로 이해하는 시각도 있다). 이는 결국 민주화 시위(1991) 등으로 이어졌고, 노태우는 이른바 '6공 황태자'로 불리던 박철언을 후계자로 지명했지만 여당 내에서도 불만이 터져나왔으며 끝내 김영삼을 후계자로 택할 수밖에 없었다. 1993년 문민정부가 출범함으로써 노태우 정부는 막을 내렸다.\r\n"
				+ "\r\n"
				+ "1992년 치러진 제14대 대선에서 민주자유당의 김영삼 후보가 당선되어 1993년에 취임하면서 대한민국은 이른바 문민정부 시대로 접어들었다. 이로써 윤보선 정부 이후 30여년만에 민간인 정부로 회귀했다. 문민정부는 하나회 군부 숙청, 금융실명제, 표현의 자유 허용, 역사 바로 세우기 운동, 지방자치 단체장 선거 부활, OECD 가입 등의 업적을 남겼다. 특히 군사 정변을 주도할 위험이 있는 군 내 사조직을 숙청하고, 12.12 관련자 및 5.18 관련 정치군인들을 처벌하기도 했다. 하지만 대한항공기 괌 추락 사고, 우암상가아파트, 성수대교 와 삼풍백화점 붕괴 사고 등의 대형 사고가 일어나 사회적인 혼란을 겪기도 했다. 또한 자유방임적 시장경제와 세계화를 추구하면서 준비없는 대규모 개방을 강행했고, 외환관리에 실패해 IMF 구제금융사건을 초래하였다. 결국 국민들의 높아진 요구를 충족시키지 못한 채 야당에게 정권을 이양할 수밖에 없었다.\r\n"
				+ "\r\n" + "국민의 정부와 참여정부\r\n" + "<nowiki />이 부분의 본문은 김대중 정부 및 노무현 정부입니다.\r\n"
				+ "1997년 치러진 제15대 대선에서 새정치국민회의의 김대중 후보가 당선되면서 헌정 사상 최초의 평화적인 정권교체가 실현되었다. 국민의 정부가 들어서면서 당면한 가장 큰 과제는 IMF 위기의 극복이었다. 국민의 정부는 '자유주의' 경제정책 추진과 금모으기 운동 등을 통해, 2001년까지 외채를 조기 상환해 IMF 관리 체제에서 벗어났으며, 국제 기준에 맞춘 자율적인 구조조정 체제를 도입해 기업의 체질개선 등을 단행했다.[26] 국민의 정부는 한반도의 평화와 인권 신장에 기여했다. 특히 대북관계에 있어서 햇볕정책을 추진하기 위해 분단 이후 처음으로 평양을 방문, 김정일 국방위원장과 남북정상회담을 하였다. 그러나 남북정상회담을 위해 2000억원에 달하는 현금을 북한 정권에게 불법 송금했다는 혐의가 사후 드러나 큰 비판을 받았다. 대북유화책을 추진했지만 연평해전, 핵실험 등 북한의 지속적인 도발이 계속되어 햇볕정책의 실효성에 의문이 제기되었다. 또한, IMF 위기 극복을 위해 국민의 정부가 추진했었던 신자유주의 정책은 승자 독식의 기형적 사회구조를 구축했다는 비판이 있으며, 지나친 구조조정과 기업 매각 등으로 대량의 실업자를 양산했다는 부정적 평가가 일부 존재한다.\r\n"
				+ "\r\n"
				+ "2002년 치러진 제16대 대선에서는 새천년민주당의 노무현 후보가 당선되면서 2003년 참여정부가 출범하였다. 2004년에는 대통령 탄핵 소추를 겪는 등 위기를 맞기도 했으나, 여론의 반발과 헌법재판소의 기각 결정으로 노무현 대통령은 직에 복귀했으며, 2004년 제17대 총선에서 여당인 열린우리당이 탄핵역풍을 맞은 야당을 누르고 과반수 의석을 차지하면서 국정 탄력을 받았다. 참여 정부는 권위주위 타파, 균형 발전 등 개혁적이고 진보적인 정책을 수립했다. 진실 화해를 위한 과거사 정리위원회 설치를 통한 과거사 정리, 세종특별자치시 추진으로 균형 발전을 꾀했다는 평가가 있다. 하지만, 참여정부는 현실을 고려하지 않은 지나친 개혁과 대통령의 과격한 발언 등으로 보수층과 중도층의 반발을 불러왔고, 노무현 대통령의 형인 노건평 씨의 측근 비리 등 각종 악재로 인하여 임기 중반에 지지율이 하락하기도 하였다. 경제적으로는 부동산 가격 폭등, 양극화를 심화시켰으며, 양극화의 원인으로 제시되어 많은 사회적 논란을 낳은 비정규직 문제를 해결하지 못했다. 또한 노무현 재임 당시 교육부총리였던 김진표가 추진한 정책으로 인하여 대학 등록금도 큰 폭으로 상승하는 등 서민의 경제적 어려움을 가중시켰다는 지적도 있다.\r\n"
				+ "\r\n" + "이명박 정부와 박근혜 정부\r\n" + "<nowiki />이 부분의 본문은 이명박 정부 및 박근혜 정부입니다.\r\n"
				+ "2007년 치러진 제17대 대선에서 한나라당의 이명박 후보가 대통령에 당선되었다. 이명박 정부는 7대 강국, 4만달러 시대, 7% 성장('747 공약')을 내세웠다. 하지만 집권 초인 2008년 미국발 세계 금융 위기의 여파로 인한 경제적 위기와, 광우병소 수입 반대 촛불집회로 인한 정치적 위기를 동시에 겪었다. 금융위기를 극복하기 위해 이명박 정부는 여러 정책을 시도하는데, 그 중 대표적인 것이 4대강 사업이다. 4대강 사업은 건설경기를 살렸고 홍수 피해를 줄였다는 긍정적 평가와 세금 낭비와 환경파괴라는 부정적 평가가 각각 존재한다. 2010년에는 G20정상회의 개최와, 2012년 핵안보정상회의를 개최하여 외교적 성과를 이뤘고, 금융위기 극복, 국가신용등급 향상, 원전 수주 등 다양한 성과를 거두었다는 긍정적인 평가가 있다. 하지만 미디어법 개정으로 언론장악이 아니냐는 비판도 있으며, 세종시 수정안과 같이 여러 정책들의 추진에 대한 찬반 양론이 존재한다. 또한, 종합부동산세 폐지로 부자 감세 의혹이 제기되었고,[27] 야심차게 추진한 자원외교에 대해서는 세금 낭비와 비리 의혹이 제기되어 논란이 되고 있다.[28]\r\n"
				+ "\r\n" + "\r\n" + "박근혜 대통령 퇴진 운동\r\n"
				+ "2012년 치러진 제18대 대선에서는 새누리당의 박근혜 후보가 대통령에 당선되었다. 그러나 국정원의 선거 개입 의혹이 제기되며 출범부터 논란에 휩싸였고, 이어 잇따른 인사의 실패로 국정운영에 어려움을 겪었다. 더구나 2014년 4월 세월호 참사와 2015년 메르스 사태 등으로 재난 대책에 미숙한 모습을 드러내었으며, 창조경제와 노동개혁, 국정교과서 추진, 한일 위안부 합의, 사드(THAAD, 고고도 미사일 방어 체계) 배치 결정, 통합진보당 해체 등 여러 정책에 대해 사회적 비판과 갈등을 겪은 데다가 2016년 4월 제20대 총선에서 여소야대 국회가 다시금 등장하면서 정치적 위기를 맞았다. 결국 2016년 10월 민간인 신분인 최순실 씨의 국정 농단 사태가 밝혀지면서 박근혜 대통령 퇴진 운동이 시작되었고, 국회는 박근혜 대통령 탄핵 소추안을 가결시키며 박근혜 대통령의 권한이 정지, 황교안 대통령 권한대행 체제가 확립되었다. 2017년 3월 10일 헌법재판소의 탄핵 인용으로 박근혜 대통령은 헌정 사상 최초로 파면된 대통령이 되었다.\r\n"
				+ "\r\n" + "문재인 정부\r\n" + "<nowiki />이 부분의 본문은 문재인 정부입니다.\r\n" + "\r\n" + "취임 선서를 하는 문재인 대통령\r\n"
				+ "2017년 5월 10일에 치러진 제19대 대선에서 더불어민주당의 문재인 후보가 대통령으로 당선되었다. 문재인 정부는 임기 초반기부터 7~80%대의 높은 지지율을 유지했으며, 탈권위주의 정책 및 적폐청산 정책으로 국민들의 호응을 받았다. 하지만 5대 원칙 공약 파기 및 부실한 인사들을 무리하게 임명하여 논란이 일었고 또 문재인 케어 논란, 탈원전 논란, 코리아 패싱 등으로 계속 논란이 일었다. 그리고 2018년 초반기에 들어서서 남북 단일팀 논란, 가상화폐 규제 등을 무리하게 밀어붙이고 미세먼지 공약 미이행 논란까지 불거지면서 보수층과 중도층, 젊은층의 반발로 지지율이 하락했다. 그러나 탈권위주의 정책과 적폐청산 정책을 과감히 추진하고 평창 동계올림픽의 흥행으로 다시 지지율이 상승했다. 하지만 대한민국의 미투 운동에 더불어민주당의 일부 정계인사들이 연루되고, 금융감독원장에 임명된 김기식이 여러 논란에 휩싸임과 동시에 더불어민주당원 댓글 조작 사건이 불거지면서 다시 위기에 몰렸으나 2018년 제1차 남북정상회담과 2018년 제2차 남북정상회담을 통해서 평화무드를 조성하면서 지지율을 크게 상승시켰고, 이어진 제7회 전국동시지방선거에서 더불어민주당이 크게 승리하면서 국정운영에 계속 탄력을 받게 되었다. 하지만 지방선거 이후 경제가 하락하고 제주 난민 사태, 일자리 정책 실패, 최저임금 인상 논란, 근로시간 주52시간 단축 논란, 부동산 대책 논란, 리비아 한국인 납치 사건 대처 미흡 논란, 북한 석탄 밀수 사건, 국방백서 북한 주적 삭제 논란, 통계청장 경질 논란이 불거지고 이에 대해 문재인 정부가 주변의 비판여론에도 불구하고 밀어붙이면서 보수층, 중도층, 젊은층의 반발을 불러일으키면서 문재인 정부의 지지율이 계속 하락했다. 그러나 2018년 제3차 남북정상회담을 잘 이끌어내면서 지지율이 다시 상승기류를 탔다.\r\n"
				+ "\r\n" + "정치\r\n" + "<nowiki />이 부분의 본문은 대한민국의 정치입니다.\r\n"
				+ "대한민국 임시정부는 1919년 4월 13일에 중화민국 상하이에서 수립되었으며 1945년 8월 15일 일본 제국으로부터 해방되었다. 신탁 통치 찬반을 놓고 좌파 진영과 우파 진영 간의 갈등이 극에 달하게 되었으며, 이후 미국과 구 소련의 분할 군정에 놓여 있다가, 1948년 5월 10일 총선을 거쳐 7월 17일 첫 헌법이 제정되었고 8월 15일에 대한민국임시정부의 정통성을 이어받은 대한민국 정부로 공식 출범하게 된다.\r\n"
				+ "\r\n"
				+ "대한민국은 자유민주적 기본절서에 입각한 자유 민주 공화국으로 대통령제를 기본으로 하여 의원내각제적 요소를 혼합한 정치 제도(그 예로 국무총리가 존재하고, 국회의원이 장·차관급 공직자를 지낼 수 있다)를 채택하고 있고, 대한제국이 일본에 의해 멸망한 후 3·1 운동 정신으로 창립된 대한민국 임시정부의 법통과 독재의 불의에 항거한 4·19 혁명의 민주주의 이념을 계승함을 헌법 전문에 명백히 밝혀두고 있다.\r\n"
				+ "\r\n"
				+ "한편 대한민국 헌법은 1948년 7월 17일 공포되었으며 개인의 인권을 존중하고 사유재산을 인정하고 있다. 그 이후에도 헌법은 9차례에 걸쳐 개정되었다. 그 가운데 박정희 때의 유신 헌법은 긴급조치 등 대통령의 권한을 강화해 국민의 자유기본권을 제약하는 비민주적이었지만 그 당시 국내외를 둘러싼 환경에 의해 불가피한 조치였다는 다른 시각도 있다. 현재 발효 중인 헌법은 제6공화국의 수립에 따라 1987년 여야 합의를 통해 개정되었다. 또한 3권 분립의 원칙에 따라 독립적인 세 개의 권력 기관을 근간으로 하여 국가를 구성하고 있다.\r\n"
				+ "\r\n" + "정부\r\n" + "입법부\r\n" + "\r\n" + "국회의사당\r\n" + "<nowiki />이 부분의 본문은 대한민국 국회입니다.\r\n"
				+ "입법부의 주축을 이루고 있는 대한민국 국회는 현재 총 300석의 단원제로 구성되어 있다. 대한민국 임시정부의 입법부였던 임시의정원을 기원으로 두고 있으며, 1948년 5월 10일 구성된 제헌국회가 대한민국 최초의 국회이다. 매년 1회의 정기회(100일 이내)와 30일 이내의 임시회가 열리며, 회기 중에 국회는 법의 의결권과 예산안의 심사, 국정 감사와 헌법에 명시된 기관장의 임명 동의 및 조약의 체결 및 비준 동의 등의 활동을 한다.\r\n"
				+ "\r\n"
				+ "대한민국 국회의원의 임기는 4년이며, 임기 중 의사진행과 관한 발언에 대한 면책특권과 회기 중 불체포특권을 가진다. 공직선거법에 따른 피선거권을 충족한 인물로, 국회의원 총선거나 재선거 및 보궐선거, 혹은 대한민국 중앙선거관리위원회의 비례대표 의석승계 결정에 따라 선출된다. 대한민국 국회의장과 부의장은 국회의원 중에서 본회의의 무기명 투표를 거쳐 선출되며, 그 임기는 국회 회기의 절반에 해당되는 2년이다.\r\n"
				+ "\r\n" + "행정부\r\n" + "<nowiki />이 부분의 본문은 대한민국 정부입니다.\r\n" + "\r\n" + "정부서울청사\r\n"
				+ "대한민국의 행정부에 해당하는 대한민국 정부는 대통령을 수반으로 하여 입법부에서 법률로써 정한 사안들을 실행한다. 대통령은 국무총리와 국무위원으로 구성된 국무회의의 조력을 받아 업무를 처리한다.\r\n"
				+ "\r\n"
				+ "대통령은 5년 단임으로 국민의 보통, 평등, 직접, 비밀 선거에 의하여 선출된다. 대통령은 국회가 통과한 법률을 거부할 권한이 있다. 그러나 한 번 거부한 법률을 국회가 다시 통과시킨다면(단, 국회는 재적의원 과반수의 출석과 3분의 2의 동의를 얻어야 한다.) 그 법률은 그대로 통과된다. 대통령은 헌법재판소의 재판관 3인과 대법관 등을 임명할 수 있다. 대통령은 조약을 체결·비준하고, 외교사절을 신임·접수 또는 파견하며, 선전포고와 강화를 할 권한을 가지고 있으며, 국군을 통수하며 공무원 임명을 할 수 있는 등 국정 전반에 걸쳐 방대한 권한을 행사한다.\r\n"
				+ "\r\n"
				+ "대통령의 명을 받아 내각을 통할하기 위하여, 대통령의 보좌기관으로서 국무총리를 두고 있다. 국무총리는 대통령이 임명하되 국회의 동의를 받아야 한다. 국무총리는 내각의 구성원을 대통령에게 임명을 제청하며 내각을 통솔한다. 대통령의 유고 시 국무총리가 대통령의 권한을 대행하게 되며 국무총리가 유고시 경제부총리 겸 기획재정부 장관, 사회부총리 겸 교육부 장관 순으로 권한을 대행한다.\r\n"
				+ "\r\n" + "사법부\r\n" + "\r\n" + "대법원\r\n" + "<nowiki />이 부분의 본문은 대한민국의 법원입니다.\r\n"
				+ "대한민국의 사법부는 대다수의 현대 국가들과 마찬가지로, 재판에 있어서 공정한 심판을 위해 3심제로 이루어져 있다. 대법원을 최고법원으로, 그 밑에 고등법원, 지방법원, 지방법원의 지원과 특허법원, 가정법원, 행정법원 등의 전문성을 요구하는 법률 심사를 위해 설치된 특수법원(여기에서의 재판은 1심의 판결과 동일하다.)으로 구성되어 있다. 대한민국 국군의 경우 군사법원법에 따라 군사재판을 할 수 있으나, 최종심은 대법원이 관할한다.\r\n"
				+ "\r\n"
				+ "한편 법원과는 별도로 각종 법령 등의 위헌 여부를 심사하는 헌법 재판소가 구성되어 있다. 헌법재판소에서는 법률이 헌법에 위배되는지를 판가름하는 위헌법률심판, 대통령을 비롯한 공무원의 탄핵 소추를 심사하는 탄핵심판, 위헌 정당의 해산 여부를 심사하는 정당해산심판, 권한쟁의심판, 헌법소원심판 등을 심사한다. 헌법재판소의 재판관은 총 9명이며, 대통령, 국회, 대법원장이 각각 3명씩 선출하고 대통령이 임명한다. 헌법재판소장은 대통령이 국회의 동의를 얻어 임명한다.\r\n"
				+ "\r\n"
				+ "최고 법원인 대법원의 법관인 대법관은 대법원장의 제청에 따라 국회 동의를 거쳐 대통령이 임명한다. 대법관의 임기는 헌법을 통해 보장되며, 그 연한은 6년이다.\r\n"
				+ "\r\n" + "정당\r\n" + "<nowiki />이 부분의 본문은 대한민국의 정당입니다.\r\n"
				+ "대한민국에서는 헌법 제8조에 의해 자유롭게 정당을 결성할 수 있으며, 복수정당제가 보장된다. 가장 최근에는 20대 국회가 2016년 5월 30일부터 개원하였다. 2017년 6월을 기준으로 여당과 1석 차이로 원내 제1당이 된 더불어민주당이 있으며 그 밖의 원내 교섭단체를 구성한 정당(국회에 의석을 20석 이상 가진 정당)으로는 자유한국당, 바른미래당이 있다. 비교섭단체인 정당(국회에 의석을 1석 이상 가진 정당)으로는 정의당, 민주평화당, 민중당, 대한애국당이 있다. 국회에 의석이 없는 정당으로는 노동당, 녹색당 등이 있다. 제20대 총선 당시에는 더불어민주당 123석, 새누리당 122석, 국민의당 38석, 정의당 6석으로 더불어민주당이 원내 제1당이 되었다. 새누리당 공천을 받지 못해 탈당한 새누리당 전 소속 의원들이 무소속으로 당선되면서 새누리당에 재입당 하여 129석으로 새누리당이 다시 원내 제1당이 되었으나, 박근혜-최순실 게이트의 여파로 인해 비박계들이 탈당하였고, 94석으로 줄어 다시 원내 제2당이 되었고, 바른정당 소속의 탈당계가 들어옴에 따라 110석 이상을 확보하였다. 2018년 현재의 정당별 의석 수는 더불어민주당 129석, 자유한국당 112석, 바른미래당 30석[29], 민주평화당 14석, 정의당 5석, 민중당과 대한애국당이 각각 1석이다.";
		System.out.println("------------------------------");
		
//		String searchWord = "대통령";
//		int result = wordCount(searchWord, wiki);
//		System.out.println(searchWord + " 횟수: " + result);
		
		KeywordExtractor extractor = new KeywordExtractor();
		KeywordList list = extractor.extractKeyword(wiki, true);
		for(int i = 0; i < list.size(); i++) {
			Keyword word = list.get(i);
			if(word.getString().equals("대한민국")) {
				System.out.println(word.getString() + " : " +word.getCnt());
			}
		}
	}

	private static int wordCount(String searchWord , String wiki) {
		wiki = wiki.replace("\r\n", "");
		wiki = wiki.replace("<nowiki />", "");
		String[] korea = wiki.split(" ");
		System.out.println(searchWord.length());
		int count = 0;
		for(String s: korea) {
			if(s.trim().startsWith(searchWord)) {
				System.out.println(s);
				count++;
			}
		}
		return count;
	}
}
